/**************************************************************************************
*功能:开关量信号检测												              
*硬件链接: LED-->P1.0											  
*          signal-->P3.5(模块的开关量信号DO)				  							
*作者:研发中心																		 
*公司:科睿电子产品有限公司 														 
*电话:0530-2897239   15192459227			  										  
*地址:菏泽开发区广州路与淮河路交叉口科睿电子产品有限公司						  
***************************************************************************************/
#include<reg52.h>  	 //52单片机头文件     
#define uint unsigned int //宏定义
sbit LED=P1^0;	 	 //信号指示灯LED
sbit signal=P3^5;	 //模块开关量信号DO
/*
********************************************************************************
** 函数名称 : delay(uint x)
** 函数功能 : 延时函数
********************************************************************************
*/
void delay(uint x)	//ms延时函数
{
 uint a,b;
 for(a=x;a>0;a--)
  for(b=110;b>0;b--);

}
//*************************
//**********主函数*********
//*************************
void main()
{
   LED=1;//初始化LED
	while(1)   
	{  
	 if(signal==0)	//检测DO是否有低电平输出
	 {
    	    delay(5);	//延时去抖
		if(signal==0)//确定DO输出低电平
	    {				   
		 LED=0;	   //点亮LED
		}
	 }
    }
}	

